window.stationsLines = [
    {
        "id": "line1",
        "name": "Сокольническая линия",
        "color": "e42518",
        "stations": [
            {
                "name": "Бульвар Рокоссовского",
                "id": "line1_1",
                "top": 312,
                "left": 868
            },
            {
                "name": "Черкизовская",
                "id": "line1_2",
                "top": 340,
                "left": 868
            },
            {
                "name": "Преображенская площадь",
                "id": "line1_3",
                "top": 369,
                "left": 868
            },
            {
                "name": "Сокольники",
                "id": "line1_4",
                "top": 401,
                "left": 868
            },
            {
                "name": "Красносельская",
                "id": "line1_5",
                "top": 426,
                "left": 868
            },
            {
                "name": "Комсомольская",
                "id": "line1_6",
                "top": 472,
                "left": 834
            },
            {
                "name": "Красные ворота",
                "id": "line1_7",
                "top": 514,
                "left": 792
            },
            {
                "name": "Чистые пруды",
                "id": "line1_8",
                "top": 553,
                "left": 752,
                "labelTop": -4,
                "labelLeft": 6
            },
            {
                "name": "Лубянка",
                "id": "line1_9",
                "top": 594,
                "left": 712
            },
            {
                "name": "Охотный Ряд",
                "id": "line1_10",
                "top": 675,
                "left": 631
            },
            {
                "name": "Библиотека им. Ленина",
                "id": "line1_11",
                "top": 752,
                "left": 553
            },
            {
                "name": "Кропоткинская",
                "id": "line1_12",
                "top": 789,
                "left": 502
            },
            {
                "name": "Парк культуры",
                "id": "line1_13",
                "top": 803,
                "left": 420
            },
            {
                "name": "Фрунзенская",
                "id": "line1_14",
                "top": 830,
                "left": 393
            },
            {
                "name": "Спортивная",
                "id": "line1_15",
                "top": 857,
                "left": 366
            },
            {
                "name": "Воробьёвы горы",
                "id": "line1_16",
                "top": 884,
                "left": 339
            },
            {
                "name": "Университет",
                "id": "line1_17",
                "top": 910,
                "left": 313
            },
            {
                "name": "Проспект Вернадского",
                "id": "line1_18",
                "top": 936,
                "left": 287
            },
            {
                "name": "Юго-Западная",
                "id": "line1_19",
                "top": 964,
                "left": 259
            },
            {
                "name": "Тропарёво",
                "id": "line1_20",
                "top": 992,
                "left": 231
            },
            {
                "name": "Румянцево",
                "id": "line1_21",
                "top": 992,
                "left": 231
            },
            {
                "name": "Саларьево",
                "id": "line1_22",
                "top": 992,
                "left": 231
            },
            {
                "name": "Филатов Луг",
                "id": "line1_23",
                "top": 992,
                "left": 231
            },
            {
                "name": "Прокшино",
                "id": "line1_24",
                "top": 992,
                "left": 231
            },
            {
                "name": "Ольховая",
                "id": "line1_25",
                "top": 992,
                "left": 231
            },
            {
                "name": "Коммунарка",
                "id": "line1_26",
                "top": 992,
                "left": 231
            }
        ]
    },
    {
        "id": "line2",
        "name": "Замоскворецкая линия",
        "color": "4baf4f",
        "stations": [
            {
                "name": "Ховрино",
                "id": "line2_1",
                "top": 254,
                "left": 373
            },
            {
                "name": "Беломорская",
                "id": "line2_2",
                "top": 254,
                "left": 373
            },
            {
                "name": "Речной вокзал",
                "id": "line2_3",
                "top": 254,
                "left": 373
            },
            {
                "name": "Водный стадион",
                "id": "line2_4",
                "top": 282,
                "left": 373
            },
            {
                "name": "Войковская",
                "id": "line2_5",
                "top": 311,
                "left": 373
            },
            {
                "name": "Сокол",
                "id": "line2_6",
                "top": 339,
                "left": 373
            },
            {
                "name": "Аэропорт",
                "id": "line2_7",
                "top": 368,
                "left": 373
            },
            {
                "name": "Динамо",
                "id": "line2_8",
                "top": 446,
                "left": 401
            },
            {
                "name": "Белорусская",
                "id": "line2_9",
                "top": 483,
                "left": 438
            },
            {
                "name": "Маяковская",
                "id": "line2_10",
                "top": 554,
                "left": 510
            },
            {
                "name": "Тверская",
                "id": "line2_11",
                "top": 593,
                "left": 548
            },
            {
                "name": "Театральная",
                "id": "line2_12",
                "top": 660,
                "left": 616
            },
            {
                "name": "Новокузнецкая",
                "id": "line2_13",
                "top": 808,
                "left": 744
            },
            {
                "name": "Павелецкая",
                "id": "line2_14",
                "top": 899,
                "left": 744
            },
            {
                "name": "Автозаводская",
                "id": "line2_15",
                "top": 945,
                "left": 743
            },
            {
                "name": "Технопарк",
                "id": "line2_16",
                "top": 945,
                "left": 743
            },
            {
                "name": "Коломенская",
                "id": "line2_17",
                "top": 973,
                "left": 743
            },
            {
                "name": "Каширская",
                "id": "line2_18",
                "top": 1008,
                "left": 743
            },
            {
                "name": "Кантемировская",
                "id": "line2_19",
                "top": 1059,
                "left": 743
            },
            {
                "name": "Царицыно",
                "id": "line2_20",
                "top": 1088,
                "left": 744
            },
            {
                "name": "Орехово",
                "id": "line2_21",
                "top": 1116,
                "left": 744
            },
            {
                "name": "Домодедовская",
                "id": "line2_22",
                "top": 1159,
                "left": 787
            },
            {
                "name": "Красногвардейская",
                "id": "line2_23",
                "top": 1159,
                "left": 881
            },
            {
                "name": "Алма-Атинская",
                "id": "line2_24",
                "top": 1159,
                "left": 881
            }
        ]
    },
    {
        "id": "line3",
        "name": "Арбатско-Покровская линия",
        "color": "0572b9",
        "stations": [
            {
                "name": "Пятницкое шоссе",
                "id": "line3_1",
                "top": 339,
                "left": 127
            },
            {
                "name": "Митино",
                "id": "line3_2",
                "top": 339,
                "left": 127
            },
            {
                "name": "Волоколамская",
                "id": "line3_3",
                "top": 368,
                "left": 126
            },
            {
                "name": "Мякинино",
                "id": "line3_4",
                "top": 397,
                "left": 126
            },
            {
                "name": "Строгино",
                "id": "line3_5",
                "top": 425,
                "left": 126
            },
            {
                "name": "Крылатское",
                "id": "line3_6",
                "top": 453,
                "left": 126
            },
            {
                "name": "Молодёжная",
                "id": "line3_7",
                "top": 482,
                "left": 127
            },
            {
                "name": "Кунцевская",
                "id": "line3_8",
                "close": true,
                "top": 511,
                "left": 126
            },
            {
                "name": "Славянский бульвар",
                "id": "line3_9",
                "close": true,
                "top": 722,
                "left": 171
            },
            {
                "name": "Парк Победы",
                "id": "line3_10",
                "top": 722,
                "left": 283
            },
            {
                "name": "Киевская",
                "id": "line3_11",
                "top": 722,
                "left": 386
            },
            {
                "name": "Смоленская",
                "id": "line3_12",
                "top": 723,
                "left": 453
            },
            {
                "name": "Арбатская",
                "id": "line3_13",
                "top": 722,
                "left": 523
            },
            {
                "name": "Площадь Революции",
                "id": "line3_14",
                "top": 689,
                "left": 644
            },
            {
                "name": "Курская",
                "id": "line3_15",
                "top": 624,
                "left": 857
            },
            {
                "name": "Бауманская",
                "id": "line3_16",
                "top": 583,
                "left": 912
            },
            {
                "name": "Электрозаводская",
                "id": "line3_17",
                "top": 556,
                "left": 939
            },
            {
                "name": "Семёновская",
                "id": "line3_18",
                "top": 454,
                "left": 991
            },
            {
                "name": "Партизанская",
                "id": "line3_19",
                "top": 425,
                "left": 990
            },
            {
                "name": "Измайловская",
                "id": "line3_20",
                "top": 400,
                "left": 991
            },
            {
                "name": "Первомайская",
                "id": "line3_21",
                "top": 368,
                "left": 991
            },
            {
                "name": "Щёлковская",
                "id": "line3_22",
                "top": 340,
                "left": 991
            }
        ]
    },
    {
        "id": "line4",
        "name": "Филёвская линия",
        "color": "24bcee",
        "stations": [
            {
                "name": "Александровский сад",
                "id": "line4_1",
                "top": 722,
                "left": 553
            },
            {
                "name": "Арбатская",
                "id": "line4_2",
                "top": 707,
                "left": 486
            },
            {
                "name": "Смоленская",
                "id": "line4_3",
                "top": 708,
                "left": 439
            },
            {
                "name": "Киевская",
                "id": "line4_4",
                "top": 708,
                "left": 371
            },
            {
                "name": "Студенческая",
                "id": "line4_7",
                "top": 708,
                "left": 306
            },
            {
                "name": "Кутузовская",
                "id": "line4_8",
                "top": 707,
                "left": 217
            },
            {
                "name": "Фили",
                "id": "line4_9",
                "top": 639,
                "left": 141
            },
            {
                "name": "Багратионовская",
                "id": "line4_10",
                "top": 610,
                "left": 141
            },
            {
                "name": "Филевский парк",
                "id": "line4_11",
                "top": 582,
                "left": 141
            },
            {
                "name": "Пионерская",
                "id": "line4_12",
                "top": 553,
                "left": 141
            },
            {
                "name": "Кунцевская",
                "id": "line4_13",
                "top": 582,
                "left": 141
            }
        ]
    },
    {
        "id": "line4",
        "name": "Филёвская линия",
        "color": "24bcee",
        "stations": [
            {
                "name": "Выставочная",
                "id": "line4_5",
                "top": 658,
                "left": 276
            },
            {
                "name": "Международная",
                "id": "line4_6",
                "top": 629,
                "left": 276
            }
        ]
    },
    {
        "id": "line5",
        "name": "Кольцевая линия",
        "color": "925233",
        "isCircle": true,
        "stations": [
            {
                "name": "Комсомольская",
                "id": "line5_1",
                "top": 486,
                "left": 819,
                "labelTop": -15,
                "labelLeft": 16
            },
            {
                "name": "Курская",
                "id": "line5_2",
                "top": 625,
                "left": 885
            },
            {
                "name": "Таганская",
                "id": "line5_3",
                "top": 736,
                "left": 874
            },
            {
                "name": "Павелецкая",
                "id": "line5_4",
                "top": 879,
                "left": 744
            },
            {
                "name": "Добрынинская",
                "id": "line5_5",
                "top": 896,
                "left": 590
            },
            {
                "name": "Октябрьская",
                "id": "line5_6",
                "top": 864,
                "left": 510
            },
            {
                "name": "Парк культуры",
                "id": "line5_7",
                "top": 789,
                "left": 434
            },
            {
                "name": "Киевская",
                "id": "line5_8",
                "top": 708,
                "left": 400,
                "labelRight": -6,
                "labelBottom": 5
            },
            {
                "name": "Краснопресненская",
                "id": "line5_9",
                "top": 608,
                "left": 399,
                "labelTop": 4,
                "labelLeft": 2
            },
            {
                "name": "Белорусская",
                "id": "line5_10",
                "top": 497,
                "left": 452,
                "labelTop": -12,
                "labelLeft": 10
            },
            {
                "name": "Новослободская",
                "id": "line5_11",
                "top": 429,
                "left": 542,
                "labelTop": 8,
                "labelLeft": 1
            },
            {
                "name": "Проспект Мира",
                "id": "line5_12",
                "top": 413,
                "left": 686,
                "labelTop": -20,
                "labelLeft": 16
            }
        ]
    },
    {
        "id": "line6",
        "name": "Калужско-Рижская линия",
        "color": "ef7e24",
        "stations": [
            {
                "name": "Медведково",
                "id": "line6_1",
                "top": 168,
                "left": 744
            },
            {
                "name": "Бабушкинская",
                "id": "line6_2",
                "top": 196,
                "left": 744
            },
            {
                "name": "Свиблово",
                "id": "line6_3",
                "top": 225,
                "left": 744
            },
            {
                "name": "Ботанический сад",
                "id": "line6_4",
                "top": 254,
                "left": 744
            },
            {
                "name": "ВДНХ",
                "id": "line6_5",
                "top": 282,
                "left": 744
            },
            {
                "name": "Алексеевская",
                "id": "line6_6",
                "top": 311,
                "left": 744
            },
            {
                "name": "Рижская",
                "id": "line6_7",
                "top": 339,
                "left": 744
            },
            {
                "name": "Проспект Мира",
                "id": "line6_8",
                "top": 398,
                "left": 700
            },
            {
                "name": "Сухаревская",
                "id": "line6_9",
                "top": 458,
                "left": 685
            },
            {
                "name": "Тургеневская",
                "id": "line6_10",
                "top": 553,
                "left": 732
            },
            {
                "name": "Китай-город",
                "id": "line6_11",
                "top": 677,
                "left": 836
            },
            {
                "name": "Третьяковская",
                "id": "line6_12",
                "top": 789,
                "left": 764
            },
            {
                "name": "Октябрьская",
                "id": "line6_13",
                "top": 878,
                "left": 495
            },
            {
                "name": "Шаболовская",
                "id": "line6_14",
                "top": 916,
                "left": 466
            },
            {
                "name": "Ленинский проспект",
                "id": "line6_15",
                "top": 945,
                "left": 465
            },
            {
                "name": "Академическая",
                "id": "line6_16",
                "top": 973,
                "left": 466
            },
            {
                "name": "Профсоюзная",
                "id": "line6_17",
                "top": 1002,
                "left": 466
            },
            {
                "name": "Новые Черёмушки",
                "id": "line6_18",
                "top": 1031,
                "left": 466
            },
            {
                "name": "Калужская",
                "id": "line6_19",
                "top": 1059,
                "left": 465
            },
            {
                "name": "Беляево",
                "id": "line6_20",
                "top": 1088,
                "left": 465
            },
            {
                "name": "Коньково",
                "id": "line6_21",
                "top": 1116,
                "left": 466
            },
            {
                "name": "Тёплый стан",
                "id": "line6_22",
                "top": 1145,
                "left": 466
            },
            {
                "name": "Ясенево",
                "id": "line6_23",
                "top": 1173,
                "left": 466
            },
            {
                "name": "Новоясеневская",
                "id": "line6_24",
                "top": 1216,
                "left": 449
            }
        ]
    },
    {
        "id": "line7",
        "name": "Таганско-Краснопресненская линия",
        "color": "943f90",
        "stations": [
            {
                "name": "Планерная",
                "id": "line7_1",
                "top": 282,
                "left": 249
            },
            {
                "name": "Сходненская",
                "id": "line7_2",
                "top": 311,
                "left": 250
            },
            {
                "name": "Тушинская",
                "id": "line7_3",
                "top": 340,
                "left": 250
            },
            {
                "name": "Спартак",
                "id": "line7_4",
                "top": 340,
                "left": 250
            },
            {
                "name": "Щукинская",
                "id": "line7_5",
                "top": 396,
                "left": 250
            },
            {
                "name": "Октябрьское поле",
                "id": "line7_6",
                "top": 425,
                "left": 250
            },
            {
                "name": "Полежаевская",
                "id": "line7_7",
                "top": 501,
                "left": 292
            },
            {
                "name": "Беговая",
                "id": "line7_8",
                "top": 526,
                "left": 318
            },
            {
                "name": "Улица 1905 года",
                "id": "line7_9",
                "top": 552,
                "left": 346
            },
            {
                "name": "Баррикадная",
                "id": "line7_10",
                "top": 594,
                "left": 384
            },
            {
                "name": "Пушкинская",
                "id": "line7_11",
                "top": 608,
                "left": 563
            },
            {
                "name": "Кузнецкий мост",
                "id": "line7_12",
                "top": 608,
                "left": 725
            },
            {
                "name": "Китай-город",
                "id": "line7_13",
                "top": 662,
                "left": 821
            },
            {
                "name": "Таганская",
                "id": "line7_14",
                "top": 735,
                "left": 853
            },
            {
                "name": "Пролетарская",
                "id": "line7_15",
                "top": 824,
                "left": 942
            },
            {
                "name": "Волгоградский проспект",
                "id": "line7_16",
                "top": 888,
                "left": 991
            },
            {
                "name": "Текстильщики",
                "id": "line7_17",
                "top": 917,
                "left": 991
            },
            {
                "name": "Кузьминки",
                "id": "line7_18",
                "top": 945,
                "left": 991
            },
            {
                "name": "Рязанский проспект",
                "id": "line7_19",
                "top": 974,
                "left": 990
            },
            {
                "name": "Выхино",
                "id": "line7_20",
                "top": 1002,
                "left": 991
            },
            {
                "name": "Лермонтовский проспект",
                "id": "line7_21",
                "top": 1002,
                "left": 991
            },
            {
                "name": "Жулебино",
                "id": "line7_22",
                "top": 1002,
                "left": 991
            },
            {
                "name": "Котельники",
                "id": "line7_23",
                "top": 1072,
                "left": 991
            }
        ]
    },
    {
        "id": "line8",
        "name": "Калининская линия",
        "color": "FFCD1E",
        "stations": [
            {
                "name": "Новокосино",
                "id": "line8_1",
                "top": 583,
                "left": 1059
            },
            {
                "name": "Новогиреево",
                "id": "line8_2",
                "top": 583,
                "left": 1059
            },
            {
                "name": "Перово",
                "id": "line8_3",
                "top": 609,
                "left": 1032
            },
            {
                "name": "Шоссе Энтузиастов",
                "id": "line8_4",
                "top": 637,
                "left": 1005
            },
            {
                "name": "Авиамоторная",
                "id": "line8_5",
                "top": 664,
                "left": 978
            },
            {
                "name": "Площадь Ильича",
                "id": "line8_6",
                "top": 715,
                "left": 927
            },
            {
                "name": "Марксистская",
                "id": "line8_7",
                "top": 715,
                "left": 853
            },
            {
                "name": "Третьяковская",
                "id": "line8_8",
                "top": 789,
                "left": 744
            }
        ]
    },
    {
        "id": "line8A",
        "name": "Солнцевская линия",
        "color": "FFCD1E",
        "stations": [
            {
                "name": "Деловой центр",
                "id": "line8A_5",
                "top": 460,
                "left": 420
            },
            {
                "name": "Парк Победы",
                "id": "line8A_6",
                "top": 789,
                "left": 744
            },
            {
                "name": "Минская",
                "id": "line8A_7",
                "top": 789,
                "left": 744
            },
            {
                "name": "Ломоносовский проспект",
                "id": "line8A_8",
                "top": 789,
                "left": 744
            },
            {
                "name": "Раменки",
                "id": "line8A_9",
                "top": 789,
                "left": 744
            },
            {
                "name": "Мичуринский проспект",
                "id": "line8A_10",
                "top": 789,
                "left": 744
            },
            {
                "name": "Озёрная",
                "id": "line8A_11",
                "top": 789,
                "left": 744
            },
            {
                "name": "Говорово",
                "id": "line8A_12",
                "top": 789,
                "left": 744
            },
            {
                "name": "Солнцево",
                "id": "line8A_13",
                "top": 789,
                "left": 744
            },
            {
                "name": "Боровское шоссе",
                "id": "line8A_14",
                "top": 789,
                "left": 744
            },
            {
                "name": "Новопеределкино",
                "id": "line8A_15",
                "top": 789,
                "left": 744
            },
            {
                "name": "Рассказовка",
                "id": "line8A_16",
                "top": 789,
                "left": 744
            }
        ]
    },
    {
        "id": "line9",
        "name": "Серпуховско-Тимирязевская линия",
        "color": "adacac",
        "stations": [
            {
                "name": "Алтуфьево",
                "id": "line9_1",
                "top": 140,
                "left": 496
            },
            {
                "name": "Бибирево",
                "id": "line9_2",
                "top": 168,
                "left": 496
            },
            {
                "name": "Отрадное",
                "id": "line9_3",
                "top": 197,
                "left": 497
            },
            {
                "name": "Владыкино",
                "id": "line9_4",
                "top": 225,
                "left": 497
            },
            {
                "name": "Петровско-Разумовская",
                "id": "line9_5",
                "top": 253,
                "left": 497
            },
            {
                "name": "Тимирязевская",
                "id": "line9_6",
                "top": 282,
                "left": 496
            },
            {
                "name": "Дмитровская",
                "id": "line9_7",
                "top": 310,
                "left": 496
            },
            {
                "name": "Савёловская",
                "id": "line9_8",
                "top": 339,
                "left": 497
            },
            {
                "name": "Менделеевская",
                "id": "line9_9",
                "top": 415,
                "left": 527
            },
            {
                "name": "Цветной бульвар",
                "id": "line9_10",
                "top": 508,
                "left": 620
            },
            {
                "name": "Чеховская",
                "id": "line9_11",
                "top": 593,
                "left": 577
            },
            {
                "name": "Боровицкая",
                "id": "line9_12",
                "top": 752,
                "left": 523
            },
            {
                "name": "Полянка",
                "id": "line9_13",
                "top": 845,
                "left": 589
            },
            {
                "name": "Серпуховская",
                "id": "line9_14",
                "top": 916,
                "left": 589
            },
            {
                "name": "Тульская",
                "id": "line9_15",
                "top": 945,
                "left": 589
            },
            {
                "name": "Нагатинская",
                "id": "line9_16",
                "top": 973,
                "left": 589
            },
            {
                "name": "Нагорная",
                "id": "line9_17",
                "top": 1002,
                "left": 589
            },
            {
                "name": "Нахимовский проспект",
                "id": "line9_18",
                "top": 1030,
                "left": 589
            },
            {
                "name": "Севастопольская",
                "id": "line9_19",
                "top": 1082,
                "left": 589
            },
            {
                "name": "Чертановская",
                "id": "line9_20",
                "top": 1116,
                "left": 589
            },
            {
                "name": "Южная",
                "id": "line9_21",
                "top": 1145,
                "left": 589
            },
            {
                "name": "Пражская",
                "id": "line9_22",
                "top": 1173,
                "left": 589
            },
            {
                "name": "Улица академика Янгеля",
                "id": "line9_23",
                "top": 1202,
                "left": 589
            },
            {
                "name": "Аннино",
                "id": "line9_24",
                "top": 1230,
                "left": 589
            },
            {
                "name": "Бульвар Дмитрия Донского",
                "id": "line9_25",
                "top": 1259,
                "left": 590
            }
        ]
    },
    {
        "id": "line10",
        "name": "Люблинско-Дмитровская линия",
        "color": "BED12E",
        "stations": [
            {
                "name": "Селигерская",
                "id": "line10_1",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Верхние Лихоборы",
                "id": "line10_2",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Окружная",
                "id": "line10_3",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Петровско-Разумовская",
                "id": "line10_4",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Фонвизинская",
                "id": "line10_5",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Бутырская",
                "id": "line10_6",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Марьина роща",
                "id": "line10_7",
                "top": 339,
                "left": 620
            },
            {
                "name": "Достоевская",
                "id": "line10_8",
                "top": 368,
                "left": 620
            },
            {
                "name": "Трубная",
                "id": "line10_9",
                "top": 487,
                "left": 620
            },
            {
                "name": "Сретенский бульвар",
                "id": "line10_10",
                "top": 533,
                "left": 732
            },
            {
                "name": "Чкаловская",
                "id": "line10_11",
                "top": 639,
                "left": 871
            },
            {
                "name": "Римская",
                "id": "line10_12",
                "top": 715,
                "left": 947
            },
            {
                "name": "Крестьянская застава",
                "id": "line10_13",
                "top": 809,
                "left": 956
            },
            {
                "name": "Дубровка",
                "id": "line10_14",
                "top": 854,
                "left": 911
            },
            {
                "name": "Кожуховская",
                "id": "line10_15",
                "top": 881,
                "left": 884
            },
            {
                "name": "Печатники",
                "id": "line10_16",
                "top": 945,
                "left": 867
            },
            {
                "name": "Волжская",
                "id": "line10_17",
                "top": 973,
                "left": 867
            },
            {
                "name": "Люблино",
                "id": "line10_18",
                "top": 1002,
                "left": 867
            },
            {
                "name": "Братиславская",
                "id": "line10_19",
                "top": 1030,
                "left": 867
            },
            {
                "name": "Марьино",
                "id": "line10_20",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Борисово",
                "id": "line10_21",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Шипиловская",
                "id": "line10_22",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Зябликово",
                "id": "line10_23",
                "top": 1059,
                "left": 867
            }
        ]
    },
    {
        "id": "line11",
        "name": "Большая Кольцевая линия",
        "color": "89CDCF",
        "stations": [
            {
                "name": "Савёловская",
                "id": "line11_1",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Петровский парк",
                "id": "line11_2",
                "top": 1059,
                "left": 867
            },
            {
                "name": "ЦСКА",
                "id": "line11_3",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Хорошёвская",
                "id": "line11_4",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Шелепиха",
                "id": "line11_5",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Деловой центр",
                "id": "line11_6",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Народное Ополчение",
                "id": "line11_7",
                "top": 339,
                "left": 620
            },
            {
                "name": "Мнёвники",
                "id": "line11_8",
                "top": 368,
                "left": 620
            },
            {
                "name": "Терехово",
                "id": "line11_9",
                "top": 487,
                "left": 620
            },
            {
                "name": "Кунцевская",
                "id": "line11_10",
                "top": 533,
                "left": 732
            },
            {
                "name": "Давыдково",
                "id": "line11_11",
                "top": 639,
                "left": 871
            },
            {
                "name": "Аминьевская",
                "id": "line11_12",
                "top": 715,
                "left": 947
            },
            {
                "name": "Мичуринский проспект",
                "id": "line11_13",
                "top": 809,
                "left": 956
            },
            {
                "name": "Проспект Вернадского",
                "id": "line11_14",
                "top": 854,
                "left": 911
            },
            {
                "name": "Новаторская",
                "id": "line11_15",
                "top": 881,
                "left": 884
            },
            {
                "name": "Воронцовская",
                "id": "line11_16",
                "top": 945,
                "left": 867
            },
            {
                "name": "Зюзино",
                "id": "line11_17",
                "top": 973,
                "left": 867
            },
            {
                "name": "Каховская",
                "id": "line11_18",
                "top": 1002,
                "left": 867
            }
        ]
    },
    {
        "id": "line11A",
        "name": "Каховская линия",
        "color": "89CDCF",
        "stations": [
            {
                "name": "Каширская",
                "id": "line11A_1",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Варшавская",
                "id": "line11A_2",
                "top": 1030,
                "left": 867
            }
        ]
    },
    {
        "id": "line12",
        "name": "Бутовская линия",
        "color": "BAC8E8",
        "stations": [
            {
                "name": "Битцевский парк",
                "id": "line12_1",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Лесопарковая",
                "id": "line12_2",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Улица Старокачаловская",
                "id": "line12_3",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Улица Скобелевская",
                "id": "line12_4",
                "top": 1330,
                "left": 489
            },
            {
                "name": "Бульвар адмирала Ушакова",
                "id": "line12_5",
                "top": 1330,
                "left": 430
            },
            {
                "name": "Улица Горчакова",
                "id": "line12_6",
                "top": 1330,
                "left": 375
            },
            {
                "name": "Бунинская аллея",
                "id": "line12_7",
                "top": 1330,
                "left": 318
            }
        ]
    },
    {
        "id": "line13",
        "name": "Монорельс",
        "color": "0A72B9",
        "stations": [
            {
                "name": "Ул. Сергея Эйзенштейна",
                "id": "line13_1",
                "top": 1330,
                "left": 375
            },
            {
                "name": "Выставочный центр",
                "id": "line13_2",
                "top": 1330,
                "left": 430
            },
            {
                "name": "Ул. Академика Королева",
                "id": "line13_3",
                "top": 1330,
                "left": 489
            },
            {
                "name": "Телецентр",
                "id": "line13_4",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Ул. Милашенкова",
                "id": "line13_5",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Тимирязевская",
                "id": "line13_6",
                "top": 1273,
                "left": 575
            }
        ]
    },
    {
        "id": "line14",
        "name": "МЦК",
        "isMCC": true,
        "color": "ffcec6",
        "stations": [
            {
                "name": "Бульвар Рокоссовского",
                "id": "line14_1",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Локомотив",
                "id": "line14_2",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Измайлово",
                "id": "line14_3",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Соколиная Гора",
                "id": "line14_4",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Шоссе Энтузиастов",
                "id": "line14_5",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Андроновка",
                "id": "line14_6",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Нижегородская",
                "id": "line14_7",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Новохохловская",
                "id": "line14_8",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Угрешская",
                "id": "line14_9",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Дубровка",
                "id": "line14_10",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Автозаводская",
                "id": "line14_11",
                "top": 1273,
                "left": 575
            },
            {
                "name": "ЗИЛ",
                "id": "line14_12",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Верхние Котлы",
                "id": "line14_13",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Крымская",
                "id": "line14_14",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Площадь Гагарина",
                "id": "line14_15",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Лужники",
                "id": "line14_16",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Кутузовская",
                "id": "line14_17",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Деловой центр",
                "id": "line14_18",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Шелепиха",
                "id": "line14_19",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Хорошево",
                "id": "line14_20",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Зорге",
                "id": "line14_21",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Панфиловская",
                "id": "line14_22",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Стрешнево",
                "id": "line14_23",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Балтийская",
                "id": "line14_24",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Коптево",
                "id": "line14_25",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Лихоборы",
                "id": "line14_26",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Окружная",
                "id": "line14_27",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Владыкино",
                "id": "line14_28",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Ботанический сад",
                "id": "line14_29",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Ростокино",
                "id": "line14_30",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Белокаменная",
                "id": "line14_31",
                "top": 1273,
                "left": 575
            }
        ]
    },
    {
        "id": "line15",
        "name": "Некрасовская линия",
        "color": "d68ab1",
        "stations": [
            {
                "name": "Электрозаводская",
                "id": "line15_0",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Лефортово",
                "id": "line15_1",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Авиамоторная",
                "id": "line15_2",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Нижегородская",
                "id": "line15_3",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Стахановская",
                "id": "line15_4",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Окская",
                "id": "line15_5",
                "top": 1330,
                "left": 489
            },
            {
                "name": "Юго-Восточная",
                "id": "line15_6",
                "top": 1330,
                "left": 489
            },
            {
                "name": "Косино",
                "id": "line15_7",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Улица Дмитриевского",
                "id": "line15_8",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Лухмановская",
                "id": "line15_9",
                "top": 1273,
                "left": 575
            },
            {
                "name": "Некрасовка",
                "id": "line15_10",
                "top": 1330,
                "left": 489
            }
        ]
    },
    {
        "id": "lineD1",
        "name": "МЦД-1",
        "isMCD": true,
        "color": "f7a600",
        "stations": [
            {
                "name": "Лобня",
                "id": "lineD1_1",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Шереметьевская",
                "id": "lineD1_2",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Хлебниково",
                "id": "lineD1_3",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Водники",
                "id": "lineD1_4",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Долгопрудная",
                "id": "lineD1_5",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Новодачная",
                "id": "lineD1_6",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Марк",
                "id": "lineD1_7",
                "top": 339,
                "left": 620
            },
            {
                "name": "Лианозово",
                "id": "lineD1_8",
                "top": 368,
                "left": 620
            },
            {
                "name": "Илимская",
                "id": "lineD1_9",
                "close": true,
                "top": 487,
                "left": 620
            },
            {
                "name": "Бескудниково",
                "id": "lineD1_10",
                "top": 533,
                "left": 732
            },
            {
                "name": "Дегунино",
                "id": "lineD1_11",
                "top": 639,
                "left": 871
            },
            {
                "name": "Окружная",
                "id": "lineD1_12",
                "top": 715,
                "left": 947
            },
            {
                "name": "Петровско-Разумовская",
                "id": "lineD1_13",
                "close": true,
                "top": 809,
                "left": 956
            },
            {
                "name": "Тимирязевская",
                "id": "lineD1_14",
                "top": 854,
                "left": 911
            },
            {
                "name": "Дмитровская",
                "id": "lineD1_15",
                "close": true,
                "top": 881,
                "left": 884
            },
            {
                "name": "Савёловская",
                "id": "lineD1_16",
                "top": 945,
                "left": 867
            },
            {
                "name": "Белорусская",
                "id": "lineD1_17",
                "top": 973,
                "left": 867
            },
            {
                "name": "Беговая",
                "id": "lineD1_18",
                "top": 1002,
                "left": 867
            },
            {
                "name": "Тестовская",
                "id": "lineD1_19",
                "top": 1030,
                "left": 867
            },
            {
                "name": "Фили",
                "id": "lineD1_20",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Славянский бульвар",
                "id": "lineD1_21",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Кунцевская",
                "id": "lineD1_22",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Рабочий поселок",
                "id": "lineD1_23",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Сетунь",
                "id": "lineD1_24",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Немчиновка",
                "id": "lineD1_25",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Сколково",
                "id": "lineD1_26",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Баковка",
                "id": "lineD1_27",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Одинцово",
                "id": "lineD1_28",
                "outside": true,
                "top": 1059,
                "left": 867
            }
        ]
    },
    {
        "id": "lineD2",
        "name": "МЦД-2",
        "isMCD": true,
        "color": "e94282",
        "stations": [
            {
                "name": "Нахабино",
                "id": "lineD2_1",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Аникеевка",
                "id": "lineD2_2",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Опалиха",
                "id": "lineD2_3",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Красногорская",
                "id": "lineD2_4",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Павшино",
                "id": "lineD2_5",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Пенягино",
                "id": "lineD2_6",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Волоколамская",
                "id": "lineD2_7",
                "top": 339,
                "left": 620
            },
            {
                "name": "Трикотажная",
                "id": "lineD2_8",
                "top": 368,
                "left": 620
            },
            {
                "name": "Тушинская",
                "id": "lineD2_9",
                "top": 487,
                "left": 620
            },
            {
                "name": "Щукинская",
                "id": "lineD2_10",
                "top": 533,
                "left": 732
            },
            {
                "name": "Стрешнево",
                "id": "lineD2_11",
                "top": 639,
                "left": 871
            },
            {
                "name": "Красный балтиец",
                "id": "lineD2_12",
                "top": 715,
                "left": 947
            },
            {
                "name": "Гражданская",
                "id": "lineD2_13",
                "top": 809,
                "left": 956
            },
            {
                "name": "Дмитровская",
                "id": "lineD2_14",
                "top": 854,
                "left": 911
            },
            {
                "name": "Марьина Роща",
                "id": "lineD2_15",
                "close": true,
                "top": 881,
                "left": 884
            },
            {
                "name": "Рижская",
                "id": "lineD2_16",
                "top": 945,
                "left": 867
            },
            {
                "name": "Каланчёвская",
                "id": "lineD2_17",
                "top": 973,
                "left": 867
            },
            {
                "name": "Курская",
                "id": "lineD2_18",
                "top": 1002,
                "left": 867
            },
            {
                "name": "Москва Товарная",
                "id": "lineD2_19",
                "top": 1030,
                "left": 867
            },
            {
                "name": "Калитники",
                "id": "lineD2_20",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Новохохловская",
                "id": "lineD2_21",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Текстильщики",
                "id": "lineD2_22",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Печатники",
                "id": "lineD2_23",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Люблино",
                "id": "lineD2_24",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Депо",
                "id": "lineD2_25",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Перерва",
                "id": "lineD2_26",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Курьяново",
                "id": "lineD2_27",
                "close": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Москворечье",
                "id": "lineD2_28",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Царицыно",
                "id": "lineD2_29",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Котляково",
                "id": "lineD2_30",
                "close": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Покровское",
                "id": "lineD2_31",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Красный строитель",
                "id": "lineD2_32",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Битца",
                "id": "lineD2_33",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Бутово",
                "id": "lineD2_34",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Щербинка",
                "id": "lineD2_35",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Остафьево",
                "id": "lineD2_36",
                "top": 1059,
                "left": 867
            },
            {
                "name": "Силикатная",
                "id": "lineD2_37",
                "outside": true,
                "top": 1059,
                "left": 867
            },
            {
                "name": "Подольск",
                "id": "lineD2_38",
                "outside": true,
                "top": 1059,
                "left": 867
            }
        ]
    }

];
